app/controllers/projects_controller.rb

  def update
    @project = Project.find(params[:id])
    @project.update_attributes(params[:project])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "projects" SET "title" = 'hello', "updated_at" = '2013-05-27 18:29:21.922848' WHERE "projects"."id" = 1

  def load_user
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "undefined"]]